Dataset/All/data/nomad-mm-wrk-compose-c6525-25g-exp15-havail1-hori1-verti1-infi1-client-t8-c512-d30-R5000-N2
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=5000
Running 30s test @ http://10.10.1.2:8080/wrk2-api/user-timeline/read
  8 threads and 512 connections
  Thread calibration: mean lat.: 5036.657ms, rate sampling interval: 16875ms
  Thread calibration: mean lat.: 4924.481ms, rate sampling interval: 17137ms
  Thread calibration: mean lat.: 5103.447ms, rate sampling interval: 17367ms
  Thread calibration: mean lat.: 5183.237ms, rate sampling interval: 17399ms
  Thread calibration: mean lat.: 4915.790ms, rate sampling interval: 16957ms
  Thread calibration: mean lat.: 5003.891ms, rate sampling interval: 16629ms
  Thread calibration: mean lat.: 5052.945ms, rate sampling interval: 17186ms
  Thread calibration: mean lat.: 5081.103ms, rate sampling interval: 17252ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    18.86s     5.47s   28.30s    57.64%
    Req/Sec    32.38      0.70    33.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.87s 
 75.000%   23.61s 
 90.000%   26.44s 
 99.000%   28.30s 
 99.900%   28.80s 
 99.990%   28.95s 
 99.999%   29.20s 
100.000%   29.20s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8634.367     0.000000            1         1.00
   11345.919     0.100000          532         1.11
   13164.543     0.200000         1053         1.25
   15048.703     0.300000         1580         1.43
   16891.903     0.400000         2113         1.67
   18874.367     0.500000         2636         2.00
   19775.487     0.550000         2899         2.22
   20725.759     0.600000         3160         2.50
   21659.647     0.650000         3421         2.86
   22609.919     0.700000         3685         3.33
   23609.343     0.750000         3951         4.00
   24051.711     0.775000         4080         4.44
   24543.231     0.800000         4210         5.00
   25034.751     0.825000         4344         5.71
   25493.503     0.850000         4475         6.67
   25952.255     0.875000         4606         8.00
   26230.783     0.887500         4672         8.89
   26443.775     0.900000         4737        10.00
   26656.767     0.912500         4803        11.43
   26935.295     0.925000         4869        13.33
   27181.055     0.937500         4936        16.00
   27312.127     0.943750         4971        17.78
   27443.199     0.950000         5000        20.00
   27590.655     0.956250         5037        22.86
   27672.575     0.962500         5065        26.67
   27787.263     0.968750         5098        32.00
   27852.799     0.971875         5120        35.56
   27901.951     0.975000         5133        40.00
   28000.255     0.978125         5151        45.71
   28082.175     0.981250         5165        53.33
   28147.711     0.984375         5181        64.00
   28196.863     0.985938         5194        71.11
   28213.247     0.987500         5200        80.00
   28262.399     0.989062         5206        91.43
   28311.551     0.990625         5214       106.67
   28393.471     0.992188         5221       128.00
   28426.239     0.992969         5228       142.22
   28491.775     0.993750         5233       160.00
   28508.159     0.994531         5234       182.86
   28573.695     0.995313         5242       213.33
   28573.695     0.996094         5242       256.00
   28590.079     0.996484         5245       284.44
   28606.463     0.996875         5246       320.00
   28622.847     0.997266         5249       365.71
   28639.231     0.997656         5250       426.67
   28655.615     0.998047         5252       512.00
   28671.999     0.998242         5253       568.89
   28737.535     0.998437         5254       640.00
   28770.303     0.998633         5255       731.43
   28803.071     0.998828         5257       853.33
   28803.071     0.999023         5257      1024.00
   28819.455     0.999121         5258      1137.78
   28819.455     0.999219         5258      1280.00
   28835.839     0.999316         5259      1462.86
   28835.839     0.999414         5259      1706.67
   28852.223     0.999512         5260      2048.00
   28852.223     0.999561         5260      2275.56
   28852.223     0.999609         5260      2560.00
   28950.527     0.999658         5261      2925.71
   28950.527     0.999707         5261      3413.33
   28950.527     0.999756         5261      4096.00
   28950.527     0.999780         5261      4551.11
   28950.527     0.999805         5261      5120.00
   29196.287     0.999829         5262      5851.43
   29196.287     1.000000         5262          inf
#[Mean    =    18855.954, StdDeviation   =     5468.281]
#[Max     =    29179.904, Total count    =         5262]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7771 requests in 30.06s, 1.65MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
  Non-2xx or 3xx responses: 1726
Requests/sec:    258.54
Transfer/sec:     56.16KB