Dataset/All/data/swarm-hr-wrk-mixed-c6525-25g-exp15-havail1-hori1-verti1-infi1-client1-t8-c512-d30-R1000-N5
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=1000
Running 30s test @ http://10.10.1.3:5000
  8 threads and 512 connections
  Thread calibration: mean lat.: 1.964ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.969ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.990ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.033ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.977ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.084ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.032ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.018ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.94ms    1.09ms   5.22ms   75.25%
    Req/Sec   132.19    119.03   500.00     57.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.50ms
 75.000%    2.63ms
 90.000%    3.57ms
 99.000%    5.22ms
 99.900%    6.29ms
 99.990%    7.81ms
 99.999%    8.04ms
100.000%    8.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.410     0.000000            1         1.00
       0.884     0.100000         2010         1.11
       1.045     0.200000         4003         1.25
       1.244     0.300000         6003         1.43
       1.386     0.400000         8015         1.67
       1.499     0.500000        10002         2.00
       1.571     0.550000        11005         2.22
       1.683     0.600000        12002         2.50
       1.905     0.650000        13001         2.86
       2.333     0.700000        14001         3.33
       2.629     0.750000        15005         4.00
       2.765     0.775000        15504         4.44
       2.915     0.800000        16009         5.00
       3.049     0.825000        16505         5.71
       3.205     0.850000        17006         6.67
       3.379     0.875000        17500         8.00
       3.473     0.887500        17751         8.89
       3.573     0.900000        18000        10.00
       3.693     0.912500        18253        11.43
       3.825     0.925000        18503        13.33
       3.981     0.937500        18752        16.00
       4.053     0.943750        18877        17.78
       4.163     0.950000        19004        20.00
       4.259     0.956250        19130        22.86
       4.375     0.962500        19252        26.67
       4.503     0.968750        19378        32.00
       4.579     0.971875        19437        35.56
       4.667     0.975000        19502        40.00
       4.743     0.978125        19565        45.71
       4.843     0.981250        19626        53.33
       4.955     0.984375        19687        64.00
       5.051     0.985938        19718        71.11
       5.127     0.987500        19752        80.00
       5.179     0.989062        19783        91.43
       5.243     0.990625        19813       106.67
       5.323     0.992188        19843       128.00
       5.395     0.992969        19860       142.22
       5.455     0.993750        19875       160.00
       5.499     0.994531        19890       182.86
       5.583     0.995313        19906       213.33
       5.679     0.996094        19921       256.00
       5.735     0.996484        19929       284.44
       5.819     0.996875        19938       320.00
       5.871     0.997266        19945       365.71
       5.943     0.997656        19953       426.67
       6.027     0.998047        19961       512.00
       6.103     0.998242        19964       568.89
       6.151     0.998437        19968       640.00
       6.199     0.998633        19972       731.43
       6.239     0.998828        19977       853.33
       6.319     0.999023        19980      1024.00
       6.447     0.999121        19982      1137.78
       6.499     0.999219        19984      1280.00
       6.651     0.999316        19987      1462.86
       6.683     0.999414        19988      1706.67
       6.767     0.999512        19990      2048.00
       6.771     0.999561        19991      2275.56
       6.775     0.999609        19992      2560.00
       6.803     0.999658        19993      2925.71
       6.831     0.999707        19994      3413.33
       7.095     0.999756        19995      4096.00
       7.095     0.999780        19995      4551.11
       7.123     0.999805        19996      5120.00
       7.123     0.999829        19996      5851.43
       7.811     0.999854        19997      6826.67
       7.811     0.999878        19997      8192.00
       7.811     0.999890        19997      9102.22
       7.871     0.999902        19998     10240.00
       7.871     0.999915        19998     11702.86
       7.871     0.999927        19998     13653.33
       7.871     0.999939        19998     16384.00
       7.871     0.999945        19998     18204.44
       8.043     0.999951        19999     20480.00
       8.043     1.000000        19999          inf
#[Mean    =        1.936, StdDeviation   =        1.093]
#[Max     =        8.040, Total count    =        19999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29932 requests in 30.01s, 12.44MB read
  Socket errors: connect 0, read 0, write 0, timeout 131
Requests/sec:    997.30
Transfer/sec:    424.59KB