Dataset/All/data/swarm-mm-wrk-compose-c6525-25g-exp12-havail0-hori1-verti1-infi1-client1-t8-c512-d30-R3000-N5
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=3000
Running 30s test @ http://10.10.1.7:8080/wrk2-api/user-timeline/read
  8 threads and 512 connections
  Thread calibration: mean lat.: 4633.653ms, rate sampling interval: 16072ms
  Thread calibration: mean lat.: 4769.384ms, rate sampling interval: 16252ms
  Thread calibration: mean lat.: 4679.625ms, rate sampling interval: 16015ms
  Thread calibration: mean lat.: 4724.798ms, rate sampling interval: 16138ms
  Thread calibration: mean lat.: 4660.500ms, rate sampling interval: 16252ms
  Thread calibration: mean lat.: 4686.575ms, rate sampling interval: 16039ms
  Thread calibration: mean lat.: 4700.668ms, rate sampling interval: 16089ms
  Thread calibration: mean lat.: 4673.399ms, rate sampling interval: 16343ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    17.60s     5.10s   26.67s    58.54%
    Req/Sec    44.62      0.48    45.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.61s 
 75.000%   21.97s 
 90.000%   24.59s 
 99.000%   26.67s 
 99.900%   27.46s 
 99.990%   27.79s 
 99.999%   27.93s 
100.000%   27.93s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7131.135     0.000000            1         1.00
   10608.639     0.100000          720         1.11
   12337.151     0.200000         1442         1.25
   14082.047     0.300000         2162         1.43
   15851.519     0.400000         2880         1.67
   17612.799     0.500000         3601         2.00
   18530.303     0.550000         3968         2.22
   19382.271     0.600000         4324         2.50
   20201.471     0.650000         4681         2.86
   21135.359     0.700000         5048         3.33
   21970.943     0.750000         5402         4.00
   22429.695     0.775000         5582         4.44
   22806.527     0.800000         5761         5.00
   23281.663     0.825000         5941         5.71
   23691.263     0.850000         6120         6.67
   24166.399     0.875000         6305         8.00
   24395.775     0.887500         6397         8.89
   24592.383     0.900000         6481        10.00
   24821.759     0.912500         6576        11.43
   25051.135     0.925000         6660        13.33
   25329.663     0.937500         6756        16.00
   25444.351     0.943750         6795        17.78
   25559.039     0.950000         6842        20.00
   25690.111     0.956250         6885        22.86
   25853.951     0.962500         6930        26.67
   25985.023     0.968750         6980        32.00
   26083.327     0.971875         7002        35.56
   26165.247     0.975000         7021        40.00
   26247.167     0.978125         7043        45.71
   26345.471     0.981250         7065        53.33
   26476.543     0.984375         7090        64.00
   26525.695     0.985938         7100        71.11
   26591.231     0.987500         7113        80.00
   26640.383     0.989062         7123        91.43
   26705.919     0.990625         7132       106.67
   26787.839     0.992188         7143       128.00
   26853.375     0.992969         7149       142.22
   26886.143     0.993750         7159       160.00
   26918.911     0.994531         7163       182.86
   26951.679     0.995313         7166       213.33
   27017.215     0.996094         7171       256.00
   27066.367     0.996484         7174       284.44
   27115.519     0.996875         7177       320.00
   27164.671     0.997266         7180       365.71
   27213.823     0.997656         7184       426.67
   27230.207     0.998047         7186       512.00
   27246.591     0.998242         7188       568.89
   27246.591     0.998437         7188       640.00
   27361.279     0.998633         7190       731.43
   27410.431     0.998828         7191       853.33
   27459.583     0.999023         7193      1024.00
   27459.583     0.999121         7193      1137.78
   27492.351     0.999219         7194      1280.00
   27656.191     0.999316         7196      1462.86
   27656.191     0.999414         7196      1706.67
   27656.191     0.999512         7196      2048.00
   27656.191     0.999561         7196      2275.56
   27770.879     0.999609         7197      2560.00
   27770.879     0.999658         7197      2925.71
   27770.879     0.999707         7197      3413.33
   27787.263     0.999756         7198      4096.00
   27787.263     0.999780         7198      4551.11
   27787.263     0.999805         7198      5120.00
   27787.263     0.999829         7198      5851.43
   27787.263     0.999854         7198      6826.67
   27934.719     0.999878         7199      8192.00
   27934.719     1.000000         7199          inf
#[Mean    =    17604.811, StdDeviation   =     5096.161]
#[Max     =    27918.336, Total count    =         7199]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10423 requests in 30.02s, 2.21MB read
  Non-2xx or 3xx responses: 2338
Requests/sec:    347.25
Transfer/sec:     75.56KB